Autodesk.Revit.Exceptions.ExceptionConvertor.GenerateAPIException(ApplicationException!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Converts a Revit native exception to a matching .NET exception.
Remarks: This function exists because it was faster to have the code calling NativeToManaged outside of the macros below and in
a single location in the function.  For managed exception processing and default exception generation this did not seem faster, so
those exception types are handled directly in the macros.